#include <stdio.h>
#include <locale.h>
void name ()
{
	setlocale(LC_ALL, "RUS");
	puts("Задание 2, нажмите enter");
	getchar();
	puts("                  *****************************************************************************************");
	puts("                  *                                                                                       *");
	puts("                  *      Тема: 'Написание и компиляция консольного приложения в среде разработки MVS 2022'*");
	puts("                  *                                                                                       *");
	puts("                  *  Выполнила:  Харлампова Василиса                                                      *");
	puts("                  *****************************************************************************************");
}

void date()
{
	setlocale(LC_ALL, "RUS");
	puts("задание 3, нажмите enter");
	getchar();
	puts(" __  __          __  __ ");
	puts("|  ||__| /| /|  |  |   |");
	puts("|__||__|  |  |  |__|   |");
}

void main()
{
	name();
	date();
}