#include <stdio.h>
#include <locale.h>
void main()
{
	setlocale(LC_ALL, "RUS");
	puts("Задание 2, нажмите enter");
	getchar();
	puts("                  *****************************************************************************************");
	puts("                  *                                                                                       *");
	puts("                  *      Тема: 'Написание и компиляция консольного приложения в среде разработки MVS 2022'*");
	puts("                  *                                                                                       *");
	puts("                  *  Выполнила:  Харлампова Василиса                                                      *");
	puts("                  *****************************************************************************************");
}